knieriem/tinygo-stm32-svd/svd/stm32h757cm7.svd
        <register>
          <name>OPTKEYR</name>
          <description>FLASH option key register</description>
          <addressOffset>0x8</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPTKEYR</name>
              <description>FLASH option bytes control access unlock key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTCR</name>
          <description>FLASH option control register</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SWAP_BANK</name>
              <description>Bank swapping option configuration bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPTCHANGEERRIE</name>
              <description>Option byte change error interrupt enable bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MER</name>
              <description>mass erase request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPTSTART</name>
              <description>Option byte start change option configuration bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPTLOCK</name>
              <description>FLASH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTSR_CUR</name>
          <description>FLASH option status register</description>
          <addressOffset>0x1C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWAP_BANK_OPT</name>
              <description>Bank swapping option status bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPTCHANGEERR</name>
              <description>Option byte change error flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IO_HSLV</name>
              <description>I</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STBY_D2</name>
              <description>D2 domain DStandby entry reset option status bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STOP_D2</name>
              <description>D2 domain DStop entry reset option status bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOT_CM7</name>
              <description>Arm Cortex</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOT_CM4</name>
              <description>Arm Cortex</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECURITY</name>
              <description>Security enable option status bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST_RAM_SIZE</name>
              <description>ST RAM size option status</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IWDG_FZ_SDBY</name>
              <description>IWDG Standby mode freeze option status bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_FZ_STOP</name>
              <description>IWDG Stop mode freeze option status bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDP</name>
              <description>Readout protection level option status byte</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RST_STDY_D1</name>
              <description>D1 domain DStandby entry reset option status bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STOP_D1</name>
              <description>D1 domain DStop entry reset option status bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG2_SW</name>
              <description>IWDG2 control mode option status bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_SW</name>
              <description>IWDG control mode option status bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOR_LEV</name>
              <description>Brownout level option status bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OPT_BUSY</name>
              <description>Option byte change ongoing flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTSR_PRG</name>
          <description>FLASH option status register</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWAP_BANK_OPT</name>
              <description>Bank swapping option configuration bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IO_HSLV</name>
              <description>I</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STBY_D2</name>
              <description>D2 domain DStandby entry reset option configuration bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STOP_D2</name>
              <description>D2 domain DStop entry reset option configuration bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOT_CM7</name>
              <description>Arm Cortex</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOT_CM4</name>
              <description>Arm Cortex</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECURITY</name>
              <description>Security enable option configuration bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST_RAM_SIZE</name>
              <description>ST RAM size option configuration bits</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IWDG_FZ_SDBY</name>
              <description>IWDG Standby mode freeze option configuration bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_FZ_STOP</name>
              <description>IWDG Stop mode freeze option configuration bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDP</name>
              <description>Readout protection level option configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>NRST_STDY_D1</name>
              <description>D1 domain DStandby entry reset option configuration bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STOP_D1</name>
              <description>D1 domain DStop entry reset option configuration bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG2_SW</name>
              <description>IWDG2 control mode option configuration bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_SW</name>
              <description>IWDG control mode option configuration bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOR_LEV</name>
              <description>Brownout level option configuration bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTCCR</name>
          <description>FLASH option clear control register</description>
          <addressOffset>0x24</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLR_OPTCHANGEERR</name>
              <description>OPTCHANGEERR reset bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT7_CURR</name>
          <description>FLASH register boot address for Arm Cortex-M7 core</description>
          <addressOffset>0x40</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT_CM7_ADD1</name>
              <description>Arm Cortex-M7 boot address 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>BOOT_CM7_ADD0</name>
              <description>Arm Cortex-M7 boot address 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT7_PRGR</name>
          <description>FLASH register boot address for Arm Cortex-M7 core</description>
          <addressOffset>0x44</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT_CM7_ADD1</name>
              <description>Arm Cortex-M7 boot address 1 configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>BOOT_CM7_ADD0</name>
              <description>Arm Cortex-M7 boot address 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT4_CURR</name>
          <description>FLASH register boot address for Arm Cortex-M4 core</description>
          <addressOffset>0x48</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT_CM4_ADD1</name>
              <description>Arm Cortex-M4 boot address 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>BOOT_CM4_ADD0</name>
              <description>Arm Cortex-M4 boot address 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT4_PRGR</name>
          <description>FLASH register boot address for Arm Cortex-M4 core</description>
          <addressOffset>0x4C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT_CM4_ADD1</name>
              <description>Arm Cortex-M4 boot address 1 configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>BOOT_CM4_ADD0</name>
              <description>Arm Cortex-M4 boot address 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCDATAR</name>
          <description>FLASH CRC data register</description>
          <addressOffset>0x5C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_DATA</name>
              <description>CRC result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACR_</name>
          <description>FLASH access control register</description>
          <addressOffset>0x100</addressOffset>
          <resetValue>0x00000037</resetValue>
          <fields>
            <field>
              <name>WRHIGHFREQ</name>
              <description>Flash signal delay</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LATENCY</name>
              <description>Read latency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTKEYR_</name>
          <description>FLASH option key register</description>
          <addressOffset>0x108</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPTKEYR</name>
              <description>FLASH option bytes control access unlock key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTCR_</name>
          <description>FLASH option control register</description>
          <addressOffset>0x118</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SWAP_BANK</name>
              <description>Bank swapping option configuration bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPTCHANGEERRIE</name>
              <description>Option byte change error interrupt enable bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MER</name>
              <description>mass erase request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPTSTART</name>
              <description>Option byte start change option configuration bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPTLOCK</name>
              <description>FLASH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTSR_CUR_</name>
          <description>FLASH option status register</description>
          <addressOffset>0x11C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWAP_BANK_OPT</name>
              <description>Bank swapping option status bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPTCHANGEERR</name>
              <description>Option byte change error flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IO_HSLV</name>
              <description>I</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STBY_D2</name>
              <description>D2 domain DStandby entry reset option status bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STOP_D2</name>
              <description>D2 domain DStop entry reset option status bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOT_CM7</name>
              <description>Arm Cortex</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOT_CM4</name>
              <description>Arm Cortex</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECURITY</name>
              <description>Security enable option status bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST_RAM_SIZE</name>
              <description>ST RAM size option status</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IWDG_FZ_SDBY</name>
              <description>IWDG Standby mode freeze option status bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_FZ_STOP</name>
              <description>IWDG Stop mode freeze option status bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDP</name>
              <description>Readout protection level option status byte</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RST_STDY_D1</name>
              <description>D1 domain DStandby entry reset option status bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STOP_D1</name>
              <description>D1 domain DStop entry reset option status bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG2_SW</name>
              <description>IWDG2 control mode option status bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_SW</name>
              <description>IWDG control mode option status bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOR_LEV</name>
              <description>Brownout level option status bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OPT_BUSY</name>
              <description>Option byte change ongoing flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
