knieriem/tinygo-stm32-svd/svd/stm32h757cm7.svd
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>RG%sCR</name>
          <displayName>RG%sCR</displayName>
          <description>DMAMux - DMA request generator channel x
          control register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIG_ID</name>
              <description>DMA request trigger input
              selected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>SIG_ID</name>
                <enumeratedValue>
                  <name>dmamux2_evt0</name>
                  <description>Signal `dmamux2_evt0` selected as trigger input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_evt1</name>
                  <description>Signal `dmamux2_evt1` selected as trigger input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_evt2</name>
                  <description>Signal `dmamux2_evt2` selected as trigger input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_evt3</name>
                  <description>Signal `dmamux2_evt3` selected as trigger input</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_evt4</name>
                  <description>Signal `dmamux2_evt4` selected as trigger input</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_evt5</name>
                  <description>Signal `dmamux2_evt5` selected as trigger input</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_evt6</name>
                  <description>Signal `dmamux2_evt6` selected as trigger input</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lpuart_rx_wkup</name>
                  <description>Signal `lpuart_rx_wkup` selected as trigger input</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lpuart_tx_wkup</name>
                  <description>Signal `lpuart_tx_wkup` selected as trigger input</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lptim2_wkup</name>
                  <description>Signal `lptim2_wkup` selected as trigger input</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lptim2_out</name>
                  <description>Signal `lptim2_out` selected as trigger input</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lptim3_wkup</name>
                  <description>Signal `lptim3_wkup` selected as trigger input</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lptim3_out</name>
                  <description>Signal `lptim3_out` selected as trigger input</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lptim4_ait</name>
                  <description>Signal `lptim4_ait` selected as trigger input</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lptim5_ait</name>
                  <description>Signal `lptim5_ait` selected as trigger input</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c4_wkup</name>
                  <description>Signal `i2c4_wkup` selected as trigger input</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi6_wkup</name>
                  <description>Signal `spi6_wkup` selected as trigger input</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>comp1_out</name>
                  <description>Signal `comp1_out` selected as trigger input</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>comp2_out</name>
                  <description>Signal `comp2_out` selected as trigger input</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rtc_wkup</name>
                  <description>Signal `rtc_wkup` selected as trigger input</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>syscfg_exti0_mux</name>
                  <description>Signal `syscfg_exti0_mux` selected as trigger input</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>syscfg_exti2_mux</name>
                  <description>Signal `syscfg_exti2_mux` selected as trigger input</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c4_event_it</name>
                  <description>Signal `i2c4_event_it` selected as trigger input</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi6_it</name>
                  <description>Signal `spi6_it` selected as trigger input</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lpuart1_it_t</name>
                  <description>Signal `lpuart1_it_t` selected as trigger input</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lpuart1_it_r</name>
                  <description>Signal `lpuart1_it_r` selected as trigger input</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>adc3_it</name>
                  <description>Signal `adc3_it` selected as trigger input</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>adc3_awd1</name>
                  <description>Signal `adc3_awd1` selected as trigger input</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bdma_ch0_it</name>
                  <description>Signal `bdma_ch0_it` selected as trigger input</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bdma_ch1_it</name>
                  <description>Signal `bdma_ch1_it` selected as trigger input</description>
                  <value>29</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OIE</name>
              <description>Interrupt enable at trigger event
              overrun</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OIE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Trigger overrun interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Trigger overrun interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GE</name>
              <description>DMA request generator channel
              enable/disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>DMA request generation disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>DMA request enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPOL</name>
              <description>DMA request generator trigger event type
              selection Defines the trigger event on the selected
              DMA request trigger input</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>GPOL</name>
                <enumeratedValue>
                  <name>NoEdge</name>
                  <description>No event, i.e. no detection nor generation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RisingEdge</name>
                  <description>Rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FallingEdge</name>
                  <description>Falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BothEdges</name>
                  <description>Rising and falling edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GNBREQ</name>
              <description>Number of DMA requests to generate
              Defines the number of DMA requests generated after a
              trigger event, then stop generating. The actual
              number of generated DMA requests is GNBREQ+1. Note:
              This field can only be written when GE bit is
              reset.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RGSR</name>
          <displayName>RGSR</displayName>
          <description>DMAMux - DMA request generator status
          register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>OF%s</name>
              <description>Trigger event overrun flag The flag is
              set when a trigger event occurs on DMA request
              generator channel x, while the DMA request generator
              counter value is lower than GNBREQ. The flag is
              cleared by writing 1 to the corresponding COFx bit in
              DMAMUX_RGCFR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OF0</name>
                <enumeratedValue>
                  <name>NoTrigger</name>
                  <description>No new trigger event occured on DMA request generator channel x, before the request counter underrun</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>New trigger event occured on DMA request generator channel x, before the request counter underrun</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RGCFR</name>
          <displayName>RGCFR</displayName>
          <description>DMAMux - DMA request generator clear flag
          register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>COF%s</name>
              <description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <name>COF0W</name>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear overrun flag</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>DMAMUX request line multiplexer interrupt
          channel status register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-15</dimIndex>
              <name>SOF%s</name>
              <description>Synchronization overrun event
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SOF0</name>
                <enumeratedValue>
                  <name>NoSyncEvent</name>
                  <description>No synchronization event occured on a DMA request line multiplexer channel x, while the DMA request counter value is lower than NBREQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SyncEvent</name>
                  <description>Synchronization event occured on a DMA request line multiplexer channel x, while the DMA request counter value is lower than NBREQ</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR</name>
          <displayName>CFR</displayName>
          <description>DMAMUX request line multiplexer interrupt
          clear flag register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-15</dimIndex>
              <name>CSOF%s</name>
              <description>Clear synchronization overrun event
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <name>CSOFW</name>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear synchronization flag</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
