knieriem/tinygo-stm32-svd/svd/stm32h757cm7.svd
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>This register contains information about the
          FIFO status and interrupt. The FMC features a FIFO that
          is used when writing to memories to transfer up to 16
          words of data.This is used to quickly write to the FIFO
          and free the AXI bus for transactions to peripherals
          other than the FMC, while the FMC is draining its FIFO
          into the memory. One of these register bits indicates the
          status of the FIFO, for ECC purposes.The ECC is
          calculated while the data are written to the memory. To
          read the correct ECC, the software must consequently wait
          until the FIFO is empty.</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>IRS</name>
              <description>Interrupt rising edge status The flag is
              set by hardware and reset by software. Note: If this
              bit is written by software to 1 it will be
              set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>IRS</name>
                <enumeratedValue>
                  <name>DidNotOccur</name>
                  <description>Interrupt rising edge did not occur</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Occurred</name>
                  <description>Interrupt rising edge occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ILS</name>
              <description>Interrupt high-level status The flag is
              set by hardware and reset by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ILS</name>
                <enumeratedValue>
                  <name>DidNotOccur</name>
                  <description>Interrupt high-level did not occur</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Occurred</name>
                  <description>Interrupt high-level occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFS</name>
              <description>Interrupt falling edge status The flag
              is set by hardware and reset by software. Note: If
              this bit is written by software to 1 it will be
              set.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>IFS</name>
                <enumeratedValue>
                  <name>DidNotOccur</name>
                  <description>Interrupt falling edge did not occur</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Occurred</name>
                  <description>Interrupt falling edge occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IREN</name>
              <description>Interrupt rising edge detection enable
              bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>IREN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt rising edge detection request disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt rising edge detection request enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ILEN</name>
              <description>Interrupt high-level detection enable
              bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ILEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt high-level detection request disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt high-level detection request enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFEN</name>
              <description>Interrupt falling edge detection enable
              bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>IFEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt falling edge detection request disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt falling edge detection request enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FEMPT</name>
              <description>FIFO empty. Read-only bit that provides
              the status of the FIFO</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>FEMPT</name>
                <enumeratedValue>
                  <name>NotEmpty</name>
                  <description>FIFO not empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Empty</name>
                  <description>FIFO empty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PMEM</name>
          <displayName>PMEM</displayName>
          <description>The FMC_PMEM read/write register contains
          the timing information for NAND Flash memory bank. This
          information is used to access either the common memory
          space of the NAND Flash for command, address write access
          and data read/write access.</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>MEMSET</name>
              <description>Common memory x setup time These bits
              define the number of KCK_FMC (+1) clock cycles to set
              up the address before the command assertion (NWE,
              NOE), for NAND Flash read or write access to common
              memory space:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>254</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MEMWAIT</name>
              <description>Common memory wait time These bits
              define the minimum number of KCK_FMC (+1) clock
              cycles to assert the command (NWE, NOE), for NAND
              Flash read or write access to common memory space.
              The duration of command assertion is extended if the
              wait signal (NWAIT) is active (low) at the end of the
              programmed value of KCK_FMC:</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>1</minimum>
                  <maximum>254</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MEMHOLD</name>
              <description>Common memory hold time These bits
              define the number of KCK_FMC clock cycles for write
              accesses and KCK_FMC+1 clock cycles for read accesses
              during which the address is held (and data for write
              accesses) after the command is de-asserted (NWE,
              NOE), for NAND Flash read or write access to common
              memory space:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>1</minimum>
                  <maximum>254</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MEMHIZ</name>
              <description>Common memory x data bus Hi-Z time These
              bits define the number of KCK_FMC clock cycles during
              which the data bus is kept Hi-Z after the start of a
              NAND Flash write access to common memory space. This
              is only valid for write transactions:</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>254</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PATT</name>
          <displayName>PATT</displayName>
          <description>The FMC_PATT read/write register contains
          the timing information for NAND Flash memory bank. It is
          used for 8-bit accesses to the attribute memory space of
          the NAND Flash for the last address write access if the
          timing must differ from that of previous accesses (for
          Ready/Busy management, refer to Section20.8.5: NAND Flash
          prewait feature).</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>ATTSET</name>
              <description>Attribute memory setup time These bits
              define the number of KCK_FMC (+1) clock cycles to set
              up address before the command assertion (NWE, NOE),
              for NAND Flash read or write access to attribute
              memory space:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>254</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ATTWAIT</name>
              <description>Attribute memory wait time These bits
              define the minimum number of x KCK_FMC (+1) clock
              cycles to assert the command (NWE, NOE), for NAND
              Flash read or write access to attribute memory space.
              The duration for command assertion is extended if the
              wait signal (NWAIT) is active (low) at the end of the
              programmed value of KCK_FMC:</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>1</minimum>
                  <maximum>254</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ATTHOLD</name>
              <description>Attribute memory hold time These bits
              define the number of KCK_FMC clock cycles during
              which the address is held (and data for write access)
              after the command de-assertion (NWE, NOE), for NAND
              Flash read or write access to attribute memory
              space:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>1</minimum>
                  <maximum>254</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ATTHIZ</name>
              <description>Attribute memory data bus Hi-Z time
              These bits define the number of KCK_FMC clock cycles
              during which the data bus is kept in Hi-Z after the
              start of a NAND Flash write access to attribute
              memory space on socket. Only valid for writ
              transaction:</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>254</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCR</name>
          <displayName>ECCR</displayName>
          <description>This register contain the current error
          correction code value computed by the ECC computation
          modules of the FMC NAND controller. When the CPU
          reads/writes the data from a NAND Flash memory page at
          the correct address (refer to Section20.8.6: Computation
          of the error correction code (ECC) in NAND Flash memory),
          the data read/written from/to the NAND Flash memory are
          processed automatically by the ECC computation module.
          When X bytes have been read (according to the ECCPS field
          in the FMC_PCR registers), the CPU must read the computed
          ECC value from the FMC_ECC registers. It then verifies if
          these computed parity data are the same as the parity
          value recorded in the spare area, to determine whether a
          page is valid, and, to correct it otherwise. The FMC_ECCR
          register should be cleared after being read by setting
          the ECCEN bit to 0. To compute a new data block, the
          ECCEN bit must be set to 1.</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>ECC result This field contains the value
              computed by the ECC computation logic. Table167
              describes the contents of these bit
              fields.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>1-4</dimIndex>
          <name>BWTR%s</name>
          <displayName>BWTR%s</displayName>
          <description>This register contains the control
          information of each memory bank. It is used for SRAMs,
          PSRAMs and NOR Flash memories. When the EXTMOD bit is set
          in the FMC_BCRx register, then this register is active
          for write access.</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>Address setup phase duration. These bits
              are written by software to define the duration of the
              address setup phase in KCK_FMC cycles (refer to
              Figure81 to Figure93), used in asynchronous accesses:
              ... Note: In synchronous accesses, this value is not
              used, the address setup phase is always 1 Flash clock
              period duration. In muxed mode, the minimum ADDSET
              value is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>Address-hold phase duration. These bits
              are written by software to define the duration of the
              address hold phase (refer to Figure81 to Figure93),
              used in asynchronous multiplexed accesses: ... Note:
              In synchronous NOR Flash accesses, this value is not
              used, the address hold phase is always 1 Flash clock
              period duration.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>1</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATAST</name>
              <description>Data-phase duration. These bits are
              written by software to define the duration of the
              data phase (refer to Figure81 to Figure93), used in
              asynchronous SRAM, PSRAM and NOR Flash memory
              accesses:</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>1</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>Bus turnaround phase duration These bits
              are written by software to add a delay at the end of
              a write transaction to match the minimum time between
              consecutive transactions (tEHEL from ENx high to ENx
              low): (BUSTRUN + 1) KCK_FMC period &amp;#8805;
              tEHELmin. The programmed bus turnaround delay is
              inserted between a an asynchronous write transfer and
              any other asynchronous /synchronous read or write
              transfer to or from a static bank. If a read
              operation is performed, the bank can be the same or a
              different one, whereas it must be different in case
              of write operation to the bank, except in muxed mode
              or mode D. In some cases, whatever the programmed
              BUSTRUN values, the bus turnaround delay is fixed as
              follows: The bus turnaround delay is not inserted
              between two consecutive asynchronous write transfers
              to the same static memory bank except for muxed mode
              and mode D. There is a bus turnaround delay of 2 FMC
              clock cycle between: Two consecutive synchronous
              write operations (in Burst or Single mode) to the
              same bank A synchronous write transfer ((in Burst or
              Single mode) and an asynchronous write or read
              transfer to or from static memory bank. There is a
              bus turnaround delay of 3 FMC clock cycle between:
              Two consecutive synchronous write operations (in
              Burst or Single mode) to different static banks. A
              synchronous write transfer (in Burst or Single mode)
              and a synchronous read from the same or a different
              bank. ...</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>Access mode. These bits specify the
              asynchronous access modes as shown in the next timing
              diagrams.These bits are taken into account only when
              the EXTMOD bit in the FMC_BCRx register is
              1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ACCMOD</name>
                <enumeratedValue>
                  <name>A</name>
                  <description>Access mode A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>Access mode B</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>Access mode C</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Access mode D</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
