knieriem/tinygo-stm32-svd/svd/stm32h757cm7.svd
        <register>
          <name>D3AMR</name>
          <displayName>D3AMR</displayName>
          <description>RCC D3 Autonomous mode
          Register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BDMAAMEN</name>
              <description>BDMA and DMAMUX Autonomous mode
              enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BDMAAMEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Clock disabled in autonomous mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Clock enabled in autonomous mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART1AMEN</name>
              <description>LPUART1 Autonomous mode
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>SPI6AMEN</name>
              <description>SPI6 Autonomous mode
              enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>I2C4AMEN</name>
              <description>I2C4 Autonomous mode
              enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>LPTIM2AMEN</name>
              <description>LPTIM2 Autonomous mode
              enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>LPTIM3AMEN</name>
              <description>LPTIM3 Autonomous mode
              enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>LPTIM4AMEN</name>
              <description>LPTIM4 Autonomous mode
              enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>LPTIM5AMEN</name>
              <description>LPTIM5 Autonomous mode
              enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>COMP12AMEN</name>
              <description>COMP12 Autonomous mode
              enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>VREFAMEN</name>
              <description>VREF Autonomous mode
              enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>RTCAMEN</name>
              <description>RTC Autonomous mode enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>CRCAMEN</name>
              <description>CRC Autonomous mode enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>SAI4AMEN</name>
              <description>SAI4 Autonomous mode
              enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>ADC3AMEN</name>
              <description>ADC3 Autonomous mode
              enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>BKPSRAMAMEN</name>
              <description>Backup RAM Autonomous mode
              enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>SRAM4AMEN</name>
              <description>SRAM4 Autonomous mode
              enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>RSR</name>
          <displayName>RSR</displayName>
          <description>RCC Reset Status Register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMVF</name>
              <description>Remove reset flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RMVF</name>
                <enumeratedValue>
                  <name>NotActivated</name>
                  <description>Reset not activated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Reset the reset status flags</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPURSTF</name>
              <description>CPU reset flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CPURSTFR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NoResetOccurred</name>
                  <description>No reset occurred for block</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ResetOccurred</name>
                  <description>Reset occurred for block</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D1RSTF</name>
              <description>D1 domain power switch reset
              flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>D2RSTF</name>
              <description>D2 domain power switch reset
              flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>BORRSTF</name>
              <description>BOR reset flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>PINRSTF</name>
              <description>Pin reset flag (NRST)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>PORRSTF</name>
              <description>POR/PDR reset flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>SFTRSTF</name>
              <description>System reset from CPU reset
              flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>IWDG1RSTF</name>
              <description>Independent Watchdog reset
              flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>WWDG1RSTF</name>
              <description>Window Watchdog reset flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>LPWRRSTF</name>
              <description>Reset due to illegal D1 DStandby or CPU
              CStop flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
          </fields>
        </register>
        <register>
          <name>C1_RSR</name>
          <displayName>C1_RSR</displayName>
          <description>RCC Reset Status Register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMVF</name>
              <description>Remove reset flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RMVF</name>
                <enumeratedValue>
                  <name>NotActivated</name>
                  <description>Reset not activated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Reset the reset status flags</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPURSTF</name>
              <description>CPU reset flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CPURSTFR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NoResetOccurred</name>
                  <description>No reset occurred for block</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ResetOccurred</name>
                  <description>Reset occurred for block</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D1RSTF</name>
              <description>D1 domain power switch reset
              flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>D2RSTF</name>
              <description>D2 domain power switch reset
              flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>BORRSTF</name>
              <description>BOR reset flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>PINRSTF</name>
              <description>Pin reset flag (NRST)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>PORRSTF</name>
              <description>POR/PDR reset flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>SFTRSTF</name>
              <description>System reset from CPU reset
              flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>IWDG1RSTF</name>
              <description>Independent Watchdog reset
              flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>WWDG1RSTF</name>
              <description>Window Watchdog reset flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>LPWRRSTF</name>
              <description>Reset due to illegal D1 DStandby or CPU
              CStop flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
          </fields>
        </register>
        <register>
          <name>C1_AHB3ENR</name>
          <displayName>C1_AHB3ENR</displayName>
          <description>RCC AHB3 Clock Register</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDMAEN</name>
              <description>MDMA Peripheral Clock
              Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MDMAEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The selected clock is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The selected clock is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA2DEN</name>
              <description>DMA2D Peripheral Clock
              Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>JPGDECEN</name>
              <description>JPGDEC Peripheral Clock
              Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>FMCEN</name>
              <description>FMC Peripheral Clocks
              Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>QSPIEN</name>
              <description>QUADSPI and QUADSPI Delay Clock
              Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>SDMMC1EN</name>
              <description>SDMMC1 and SDMMC1 Delay Clock
              Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB3ENR</name>
          <displayName>AHB3ENR</displayName>
          <description>RCC AHB3 Clock Register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDMAEN</name>
              <description>MDMA Peripheral Clock
              Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MDMAEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The selected clock is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The selected clock is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA2DEN</name>
              <description>DMA2D Peripheral Clock
              Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>JPGDECEN</name>
              <description>JPGDEC Peripheral Clock
              Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>FMCEN</name>
              <description>FMC Peripheral Clocks
              Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>QSPIEN</name>
              <description>QUADSPI and QUADSPI Delay Clock
              Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>SDMMC1EN</name>
              <description>SDMMC1 and SDMMC1 Delay Clock
              Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>DTCM1EN</name>
              <description>D1 DTCM1 block enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>DTCM2EN</name>
              <description>D1 DTCM2 block enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>ITCM1EN</name>
              <description>D1 ITCM block enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>AXISRAMEN</name>
              <description>AXISRAM block enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
          </fields>
        </register>
