knieriem/tinygo-stm32-svd/svd/stm32h757cm7.svd
        <register>
          <name>APB4ENR</name>
          <displayName>APB4ENR</displayName>
          <description>RCC APB4 Clock Register</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYSCFGEN</name>
              <description>SYSCFG peripheral clock
              enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SYSCFGEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The selected clock is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The selected clock is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART1EN</name>
              <description>LPUART1 Peripheral Clocks
              Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>SPI6EN</name>
              <description>SPI6 Peripheral Clocks
              Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>I2C4EN</name>
              <description>I2C4 Peripheral Clocks
              Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>LPTIM2EN</name>
              <description>LPTIM2 Peripheral Clocks
              Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>LPTIM3EN</name>
              <description>LPTIM3 Peripheral Clocks
              Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>LPTIM4EN</name>
              <description>LPTIM4 Peripheral Clocks
              Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>LPTIM5EN</name>
              <description>LPTIM5 Peripheral Clocks
              Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>COMP12EN</name>
              <description>COMP1/2 peripheral clock
              enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>VREFEN</name>
              <description>VREF peripheral clock
              enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>RTCAPBEN</name>
              <description>RTC APB Clock Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>SAI4EN</name>
              <description>SAI4 Peripheral Clocks
              Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>C1_APB4ENR</name>
          <displayName>C1_APB4ENR</displayName>
          <description>RCC APB4 Clock Register</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYSCFGEN</name>
              <description>SYSCFG peripheral clock
              enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SYSCFGEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The selected clock is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The selected clock is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART1EN</name>
              <description>LPUART1 Peripheral Clocks
              Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>SPI6EN</name>
              <description>SPI6 Peripheral Clocks
              Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>I2C4EN</name>
              <description>I2C4 Peripheral Clocks
              Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>LPTIM2EN</name>
              <description>LPTIM2 Peripheral Clocks
              Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>LPTIM3EN</name>
              <description>LPTIM3 Peripheral Clocks
              Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>LPTIM4EN</name>
              <description>LPTIM4 Peripheral Clocks
              Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>LPTIM5EN</name>
              <description>LPTIM5 Peripheral Clocks
              Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>COMP12EN</name>
              <description>COMP1/2 peripheral clock
              enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>VREFEN</name>
              <description>VREF peripheral clock
              enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>RTCAPBEN</name>
              <description>RTC APB Clock Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
            <field>
              <name>SAI4EN</name>
              <description>SAI4 Peripheral Clocks
              Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SYSCFGEN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>C1_AHB3LPENR</name>
          <displayName>C1_AHB3LPENR</displayName>
          <description>RCC AHB3 Sleep Clock Register</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDMALPEN</name>
              <description>MDMA Clock Enable During CSleep
              Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MDMALPEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The selected clock is disabled during csleep mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The selected clock is enabled during csleep mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA2DLPEN</name>
              <description>DMA2D Clock Enable During CSleep
              Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>JPGDECLPEN</name>
              <description>JPGDEC Clock Enable During CSleep
              Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>FLASHPREN</name>
              <description>Flash interface clock enable during csleep mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMCLPEN</name>
              <description>FMC Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>QSPILPEN</name>
              <description>QUADSPI and QUADSPI Delay Clock Enable
              During CSleep Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>SDMMC1LPEN</name>
              <description>SDMMC1 and SDMMC1 Delay Clock Enable
              During CSleep Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>D1DTCM1LPEN</name>
              <description>D1DTCM1 Block Clock Enable During CSleep
              mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>DTCM2LPEN</name>
              <description>D1 DTCM2 Block Clock Enable During
              CSleep mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>ITCMLPEN</name>
              <description>D1ITCM Block Clock Enable During CSleep
              mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>AXISRAMLPEN</name>
              <description>AXISRAM Block Clock Enable During CSleep
              mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB3LPENR</name>
          <displayName>AHB3LPENR</displayName>
          <description>RCC AHB3 Sleep Clock Register</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDMALPEN</name>
              <description>MDMA Clock Enable During CSleep
              Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MDMALPEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The selected clock is disabled during csleep mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The selected clock is enabled during csleep mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA2DLPEN</name>
              <description>DMA2D Clock Enable During CSleep
              Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>JPGDECLPEN</name>
              <description>JPGDEC Clock Enable During CSleep
              Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>FLITFLPEN</name>
              <description>FLITF Clock Enable During CSleep
              Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>FMCLPEN</name>
              <description>FMC Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>QSPILPEN</name>
              <description>QUADSPI and QUADSPI Delay Clock Enable
              During CSleep Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>SDMMC1LPEN</name>
              <description>SDMMC1 and SDMMC1 Delay Clock Enable
              During CSleep Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>D1DTCM1LPEN</name>
              <description>D1DTCM1 Block Clock Enable During CSleep
              mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>DTCM2LPEN</name>
              <description>D1 DTCM2 Block Clock Enable During
              CSleep mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>ITCMLPEN</name>
              <description>D1ITCM Block Clock Enable During CSleep
              mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
            <field>
              <name>AXISRAMLPEN</name>
              <description>AXISRAM Block Clock Enable During CSleep
              mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MDMALPEN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB1LPENR</name>
          <displayName>AHB1LPENR</displayName>
          <description>RCC AHB1 Sleep Clock Register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA1LPEN</name>
              <description>DMA1 Clock Enable During CSleep
              Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DMA1LPEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The selected clock is disabled during csleep mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The selected clock is enabled during csleep mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA2LPEN</name>
              <description>DMA2 Clock Enable During CSleep
              Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA1LPEN"/>
            </field>
            <field>
              <name>ADC12LPEN</name>
              <description>ADC1/2 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA1LPEN"/>
            </field>
            <field>
              <name>ETH1MACLPEN</name>
              <description>Ethernet MAC bus interface Clock Enable
              During CSleep Mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA1LPEN"/>
            </field>
            <field>
              <name>ETH1TXLPEN</name>
              <description>Ethernet Transmission Clock Enable
              During CSleep Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA1LPEN"/>
            </field>
            <field>
              <name>ETH1RXLPEN</name>
              <description>Ethernet Reception Clock Enable During
              CSleep Mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA1LPEN"/>
            </field>
            <field>
              <name>USB1OTGLPEN</name>
              <description>USB1OTG peripheral clock enable during
              CSleep mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA1LPEN"/>
            </field>
            <field>
              <name>USB1OTGULPILPEN</name>
              <description>USB_PHY1 clock enable during CSleep
              mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA1LPEN"/>
            </field>
            <field>
              <name>USB2OTGLPEN</name>
              <description>USB2OTG peripheral clock enable during
              CSleep mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA1LPEN"/>
            </field>
            <field>
              <name>USB2ULPILPEN</name>
              <description>USB_PHY2 clocks enable during CSleep
              mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA1LPEN"/>
            </field>
            <field>
              <name>ARTLPEN</name>
              <description>ART Clock Enable During CSleep Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA1LPEN"/>
            </field>
          </fields>
        </register>
