knieriem/tinygo-stm32-svd/svd/stm32h757cm7.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="DMA1">
      <name>DMA2</name>
      <baseAddress>0x40020400</baseAddress>
      <interrupt>
        <name>DMA2_STR0</name>
        <description>DMA2 Stream0 interrupt</description>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>DMA2_STR1</name>
        <description>DMA2 Stream1 interrupt</description>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>DMA2_STR2</name>
        <description>DMA2 Stream2 interrupt</description>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>DMA2_STR3</name>
        <description>DMA2 Stream3 interrupt</description>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>DMA2_STR4</name>
        <description>DMA2 Stream4 interrupt</description>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>DMA2_STR5</name>
        <description>DMA2 Stream5 interrupt</description>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>DMA2_STR6</name>
        <description>DMA2 Stream6 interrupt</description>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>DMA2_STR7</name>
        <description>DMA2 Stream7 interrupt</description>
        <value>70</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>HRTIM_Master</name>
      <description>High Resolution Timer: Master
      Timers</description>
      <groupName>HRTIM</groupName>
      <baseAddress>0x40017400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Master Timer Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BRSTDMA</name>
              <description>Burst DMA Update</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>BRSTDMA</name>
                <enumeratedValue>
                  <name>Independent</name>
                  <description>Update done independently from the DMA burst transfer completion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Completion</name>
                  <description>Update done when the DMA burst transfer is completed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rollover</name>
                  <description>Update done on master timer roll-over following a DMA burst transfer completion</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MREPU</name>
              <description>Master Timer Repetition
              update</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MREPU</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Update on repetition disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Update on repetition enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREEN</name>
              <description>Preload enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PREEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Preload disabled: the write access is directly done into the active register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Preload enabled: the write access is done into the preload register</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DACSYNC</name>
              <description>AC Synchronization</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DACSYNC</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No DAC trigger generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACSync1</name>
                  <description>Trigger generated on DACSync1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACSync2</name>
                  <description>Trigger generated on DACSync2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACSync3</name>
                  <description>Trigger generated on DACSync3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>A,B,C,D,E</dimIndex>
              <name>T%sCEN</name>
              <description>Timer %s counter enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TACEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Timer counter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Timer counter enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCEN</name>
              <description>Master Counter enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MCEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Master timer counter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Master timer counter enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCSRC</name>
              <description>Synchronization source</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SYNCSRC</name>
                <enumeratedValue>
                  <name>MasterStart</name>
                  <description>Master timer Start</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MasterCompare1</name>
                  <description>Master timer Compare 1 event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TimerAStart</name>
                  <description>Timer A start/reset</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TimerACompare1</name>
                  <description>Timer A Compare 1 event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCOUT</name>
              <description>Synchronization output</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SYNCOUT</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PositivePulse</name>
                  <description>Positive pulse on SCOUT output (16x f_HRTIM clock cycles)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NegativePulse</name>
                  <description>Negative pulse on SCOUT output (16x f_HRTIM clock cycles)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCSTRT</name>
              <description>Synchronization Starts
              Master</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SYNCSTRT</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No effect on the master timer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Start</name>
                  <description>A synchroniation input event starts the master timer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCRST</name>
              <description>Synchronization Resets
              Master</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SYNCRST</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No effect on the master timer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>A synchroniation input event resets the master timer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCIN</name>
              <description>ynchronization input</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SYNCIN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled. HRTIM is not synchronized and runs in standalone mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Internal</name>
                  <description>Internal event: the HRTIM is synchronized with the on-chip timer</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>External</name>
                  <description>External event: a positive pulse on HRTIM_SCIN input triggers the HRTIM</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALF</name>
              <description>Half mode enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>HALF</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Half mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Half mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETRIG</name>
              <description>Master Re-triggerable mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RETRIG</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The timer is not re-triggerable: a counter reset can be done only if the counter is stopped</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The timer is retriggerable: a counter reset is done whatever the counter state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONT</name>
              <description>Master Continuous mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CONT</name>
                <enumeratedValue>
                  <name>SingleShot</name>
                  <description>The timer operates in single-shot mode and stops when it reaches the MPER value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Continuous</name>
                  <description>The timer operates in continuous (free-running) mode and rolls over to zero when it reaches the MPER value</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKPSC</name>
              <description>HRTIM Master Clock
              prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>Master Timer Interrupt Status
          Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UPD</name>
              <description>Master Update Interrupt
              Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>UPD</name>
                <enumeratedValue>
                  <name>NoEvent</name>
                  <description>No timer update interrupt occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event</name>
                  <description>Timer update interrupt occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNC</name>
              <description>Sync Input Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SYNC</name>
                <enumeratedValue>
                  <name>NoEvent</name>
                  <description>No sync input interrupt occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event</name>
                  <description>Sync input interrupt occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REP</name>
              <description>Master Repetition Interrupt
              Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>REP</name>
                <enumeratedValue>
                  <name>NoEvent</name>
                  <description>No timer repetition interrupt occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event</name>
                  <description>Timer repetition interrupt occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>CMP%s</name>
              <description>Master Compare %s Interrupt
              Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMP1</name>
                <enumeratedValue>
                  <name>NoEvent</name>
                  <description>No compare interrupt occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event</name>
                  <description>Compare interrupt occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>ICR</displayName>
          <description>Master Timer Interrupt Clear
          Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>CMP%sC</name>
              <description>Master Compare %s Interrupt flag
              clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <name>CMP1CW</name>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears associated flag in ISR register</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UPDC</name>
              <description>Master update Interrupt flag
              clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="CMP1CW"/>
            </field>
            <field>
              <name>SYNCC</name>
              <description>Sync Input Interrupt flag
              clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="CMP1CW"/>
            </field>
            <field>
              <name>REPC</name>
              <description>Repetition Interrupt flag
              clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="CMP1CW"/>
            </field>
          </fields>
        </register>
