knieriem/tinygo-stm32-svd/svd/stm32h757cm7.svd
        <register>
          <name>CPT1CR</name>
          <displayName>CPT1ACR</displayName>
          <description>Timerx Capture 2 Control
          Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TBCMP1</name>
              <description>Timer B Compare 1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TBCMP1</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Timer X compare Y has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TriggerCapture</name>
                  <description>Timer X compare Y triggers capture Z</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TECMP2</name>
              <description>Timer E Compare 2</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TBCMP1"/>
            </field>
            <field>
              <name>TECMP1</name>
              <description>Timer E Compare 1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TBCMP1"/>
            </field>
            <field>
              <name>TB1RST</name>
              <description>Timer B output 1 Reset</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TB1RST</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Timer X output Y active to inactive transition has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TriggerCapture</name>
                  <description>Timer X output Y active to inactive transition triggers capture Z</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TE1RST</name>
              <description>Timer E output 1 Reset</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TB1RST"/>
            </field>
            <field>
              <name>TB1SET</name>
              <description>Timer B output 1 Set</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TB1SET</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Timer X output Y inactive to active transition has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TriggerCapture</name>
                  <description>Timer X output Y inactive to active transition triggers capture Z</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TE1SET</name>
              <description>Timer E output 1 Set</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TB1SET"/>
            </field>
            <field>
              <name>TDCMP2</name>
              <description>Timer D Compare 2</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TBCMP1"/>
            </field>
            <field>
              <name>TDCMP1</name>
              <description>Timer D Compare 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TBCMP1"/>
            </field>
            <field>
              <name>TD1RST</name>
              <description>Timer D output 1 Reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TB1RST"/>
            </field>
            <field>
              <name>TD1SET</name>
              <description>Timer D output 1 Set</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TB1SET"/>
            </field>
            <field>
              <name>TCCMP2</name>
              <description>Timer C Compare 2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TBCMP1"/>
            </field>
            <field>
              <name>TCCMP1</name>
              <description>Timer C Compare 1</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TBCMP1"/>
            </field>
            <field>
              <name>TC1RST</name>
              <description>Timer C output 1 Reset</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TB1RST"/>
            </field>
            <field>
              <name>TC1SET</name>
              <description>Timer C output 1 Set</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TB1SET"/>
            </field>
            <field>
              <name>TBCMP2</name>
              <description>Timer B Compare 2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TBCMP1"/>
            </field>
            <field>
              <dim>10</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-10</dimIndex>
              <name>EXEV%sCPT</name>
              <description>External Event %s Capture</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EXEV1CPT</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>External event Y has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TriggerCapture</name>
                  <description>External event Y triggers capture Z</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UPDCPT</name>
              <description>Update Capture</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>UPDCPT</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Update event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TriggerCapture</name>
                  <description>Update event triggers capture Z</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWCPT</name>
              <description>Software Capture</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SWCPT</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TriggerCapture</name>
                  <description>Force capture Z</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
