knieriem/tinygo-stm32-svd/svd/stm32h757cm7.svd
        <register>
          <name>EECR3</name>
          <displayName>EECR3</displayName>
          <description>Timer External Event Control Register
          3</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EE6F</name>
              <description>External event 6 filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>EE6F</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Filter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div1_N2</name>
                  <description>f_SAMPLING=f_HRTIM, N=2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div1_N4</name>
                  <description>f_SAMPLING=f_HRTIM, N=4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div1_N8</name>
                  <description>f_SAMPLING=f_HRTIM, N=8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2_N6</name>
                  <description>f_SAMPLING=f_EEVS/2, N=6</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2_N8</name>
                  <description>f_SAMPLING=f_EEVS/2, N=8</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4_N6</name>
                  <description>f_SAMPLING=f_EEVS/4, N=6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4_N8</name>
                  <description>f_SAMPLING=f_EEVS/4, N=8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8_N6</name>
                  <description>f_SAMPLING=f_EEVS/8, N=6</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8_N8</name>
                  <description>f_SAMPLING=f_EEVS/8, N=8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16_N5</name>
                  <description>f_SAMPLING=f_EEVS/16, N=5</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16_N6</name>
                  <description>f_SAMPLING=f_EEVS/16, N=6</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16_N8</name>
                  <description>f_SAMPLING=f_EEVS/16, N=8</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32_N5</name>
                  <description>f_SAMPLING=f_EEVS/32, N=5</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32_N6</name>
                  <description>f_SAMPLING=f_EEVS/32, N=6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32_N8</name>
                  <description>f_SAMPLING=f_EEVS/32, N=8</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EE7F</name>
              <description>External event 7 filter</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues derivedFrom="EE6F"/>
            </field>
            <field>
              <name>EE8F</name>
              <description>External event 8 filter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues derivedFrom="EE6F"/>
            </field>
            <field>
              <name>EE9F</name>
              <description>External event 9 filter</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues derivedFrom="EE6F"/>
            </field>
            <field>
              <name>EE10F</name>
              <description>External event 10 filter</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues derivedFrom="EE6F"/>
            </field>
            <field>
              <name>EEVSD</name>
              <description>External event sampling clock division</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>EEVSD</name>
                <enumeratedValue>
                  <name>Div1</name>
                  <description>f_EEVS=f_HRTIM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>f_EEVS=f_HRTIM/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>f_EEVS=f_HRTIM/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8</name>
                  <description>f_EEVS=f_HRTIM/8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1R</name>
          <displayName>ADC1R</displayName>
          <description>ADC Trigger 1 Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MPER</name>
              <description>ADC trigger 1 on Master
              Period</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MPER</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No generation of ADC trigger on timer period event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Generation of ADC trigger on timer period event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPER</name>
              <description>ADC trigger 1 on Timer E
              Period</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MPER"/>
            </field>
            <field>
              <name>AC2</name>
              <description>ADC trigger 1 on Timer A compare
              2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>AC2</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No generation of ADC trigger on timer compare event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Generation of ADC trigger on timer compare event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EC4</name>
              <description>ADC trigger 1 on Timer E compare
              4</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>EC3</name>
              <description>ADC trigger 1 on Timer E compare
              3</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>EC2</name>
              <description>ADC trigger 1 on Timer E compare
              2</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>DPER</name>
              <description>ADC trigger 1 on Timer D
              Period</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MPER"/>
            </field>
            <field>
              <name>DC4</name>
              <description>ADC trigger 1 on Timer D compare
              4</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>DC3</name>
              <description>ADC trigger 1 on Timer D compare
              3</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>DC2</name>
              <description>ADC trigger 1 on Timer D compare
              2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>CPER</name>
              <description>ADC trigger 1 on Timer C
              Period</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MPER"/>
            </field>
            <field>
              <name>CC4</name>
              <description>ADC trigger 1 on Timer C compare
              4</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>CC3</name>
              <description>ADC trigger 1 on Timer C compare
              3</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>CC2</name>
              <description>ADC trigger 1 on Timer C compare
              2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>ARST</name>
              <description>ADC trigger 1 on Timer A
              Reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ARST</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No generation of ADC trigger on timer reset and roll-over</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Generation of ADC trigger on timer reset and roll-over</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRST</name>
              <description>ADC trigger 1 on Timer B
              Reset</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ARST"/>
            </field>
            <field>
              <name>BPER</name>
              <description>ADC trigger 1 on Timer B
              Period</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MPER"/>
            </field>
            <field>
              <name>BC4</name>
              <description>ADC trigger 1 on Timer B compare
              4</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>BC3</name>
              <description>ADC trigger 1 on Timer B compare
              3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>BC2</name>
              <description>ADC trigger 1 on Timer B compare
              2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>APER</name>
              <description>ADC trigger 1 on Timer A
              Period</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MPER"/>
            </field>
            <field>
              <name>AC4</name>
              <description>ADC trigger 1 on Timer A compare
              4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>AC3</name>
              <description>ADC trigger 1 on Timer A compare
              3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-5</dimIndex>
              <name>EEV%s</name>
              <description>ADC trigger 1 on External Event
              %s</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EEV1</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No generation of ADC trigger on external event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Generation of ADC trigger on external event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>MC%s</name>
              <description>ADC trigger 1 on Master Compare
              %s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MC1</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No generation of ADC trigger on master compare event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Generation of ADC trigger on master compare event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
